Repository: common-repository/autochmod
Catalog: languages/autochmod-*.po
Languages: it_it

source: Manage settings
it_it: Modifica le opzioni

source: Settings
it_it: Impostazioni

source: Modifications allowed for %s:%s
it_it: Modifiche permesse per %s:%s

source: Folders NOT protected
it_it: Cartelle NON protette

source: Folders protected
it_it: Cartelle protette

source: Check permission config
it_it: Controlla impostazioni

source: Beware!
it_it: Attenzione!

source: At this moment the folders are write protected. In order to make changes you must before <a href="%s">enable writings</a>.
it_it: Adesso le cartelle sono protette da scrittura. Per poter fare modifiche occorre prima <a href="%s">abilitare le scritture</a>.

source: Folder preferences have been saved, but permissions hasn't been applied yet. In order to apply them you must re-enable the write protection.
it_it: Le impostazioni delle cartelle sono state salvate, ma i permessi non sono ancora stati applicati. Per applicarli devi riabilitare la protezione dalla scrittura.

source: Apply and protect folders
it_it: Applica e proteggi le cartelle

source: The protection is now permanently disabled. Remember to reactivate it when you'll finish working!
it_it: La protezione è ora disabilitata permanentemente. Ricordati di riattivarla quando avrai finito di lavorare!

source: Write permissions
it_it: Permessi di scrittura

source: For safety reasons, it's good pratice to set the folders on your site as not modifiable, in order to make more difficult attacks by hackers. In this page you can remove write permissions to your site and rehabilitate them temporarily, for example, to make upgrades and installations of new plugins or themes. When you activate this plugin for the first time, the protection isn't automatically turned on. You must follow these steps:
it_it: Per motivi di sicurezza è buona norma impostare le cartelle del tuo sito come non modificabili, per rendere più difficoltosi gli attacchi da parte di hacker. In questa pagina puoi togliere i permessi di scrittura al tuo sito e riabilitarli temporaneamente, per esempio per effettuare aggiornamenti e installazioni di nuovi plugin e temi. Quando attivi questo plugin per la prima volta la protezione non è attivata automaticamente. Devi seguire questi passi:

source: Ensure that the permission will work nicely with your server configuration
it_it: Assicurati che i permessi scelti siano corretti per la tua configurazione server

source: The default set of permission isn't strong at all, but the site will work for sure. On the other hand, suggested permissions are checked on a real call, so you can trust them.
it_it: Il set di permessi di default non è abbastanza sicuro, ma il sito funzionerà di certo. D'altro canto i permessi suggeriti sono stati verificati con una vera chiamata, quindi puoi fidarti di loro.

source: Choose which directory must been kept writeable
it_it: Scegli quali cartelle devono essere mantenute scrivibili

source: Tipically only the upload directory must be chosen. If some of your plugins or themes use a cache on disk, you must chose those directory as well. If you don't plan to upload new media too often, you can disable writing on upload directory as well.
it_it: Tipicalmente deve essere selezionata solo la cartella degli upload. Se qualche tuo plugin o tema usa una cache su disco devi selezionare anche quelle cartelle. Se pensi di non dovere aggiungere nuovi contenuti multimediali troppo spesso puoi anche disabilitare le scritture nella cartella di upload.

source: Enable folder protection
it_it: Abilita la protezione delle cartelle

source: Once you enable the protection, your choosen configuration will be applied to ALL files and directory included in your Wordpress installation dir.
it_it: Quando abiliterai la protezione, la configurazione scelta verrà applicata a TUTTI i file e le cartelle inclusi nella directory di installazione di Wordpress.

source: Disable the protection when you'll need it
it_it: Disabilita la protezione quando ti serve

source: There's a button on the right of the admin bar: clicking on it you can disable the protection for 10 minutes so you can update plugins, themes or whatever you want. After that amount of time the protection will be automatically restored at the first call to your site.
it_it: C'è un pulsante sulla destra della barra di amministrazione: cliccando su di esso disabiliterai la protezione per 10 minuti in modo da poter aggiornare plugin, temi o qualsiasi cosa vuoi. Dopo quel lasso di tempo la protezione verrà automaticamente ripristinata alla prima chiamata al tuo sito.

source: Help
it_it: Aiuto

source: It seems you've never changed the options!
it_it: Sembra che non hai mai cambiato le opzioni!

source: Maybe you would learn something about this plugin? There's a nice help for you, if you click the button on the top right of this page.
it_it: Magari vuoi imparare qualcosa su questo plugin? Ci sono delle belle spiegazioni per te, se clicchi sul pulsante in alto a destra in questa pagina.

source: Right now the folders <strong>are not</strong> write-protected: you can update Wordpress and install or edit themes and plugins.
it_it: Ora le cartelle <strong>non sono</strong> protette da scrittura: puoi aggiornare Wordpress e installare o modificare temi e plugin.

source: The protection is automatically reactivated at the end of the %d minutes required.
it_it: La protezione è automaticamente riattivata alla fine dei %d minuti richiesti.

source: Activate now the protection
it_it: Attiva ora la protezione

source: Perfect!
it_it: Perfetto!

source: Right now the folders <strong>are</strong> write-protected: you can modify only files in folders selected in the box to the left.
it_it: Ora le cartelle <strong>sono</strong> protette da scrittura: puoi modificare solo i file nelle cartelle selezionate nel box a sinistra.

source: Enable writings for %d minutes
it_it: Abilita le scritture per %d minuti

source: Enable writings forever
it_it: Abilita permanentemente le scritture

source: Manage options
it_it: Gestisci le opzioni

source: Select the folders where you want to keep writing permissions (subfolders will behave accordingly).
it_it: Seleziona le cartelle in cui vuoi mantenere i permessi di scrittura (le sottocartelle verranno impostate alla stessa maniera)

source: The wp-content/uploads folder is currently not writeable. Upload of new images and attachments will fail.
it_it: La cartella wp-content/upload al momento non è scrivibile. Non sarà possibile caricare nuove immagini ed allegati.

source: The wp-content/blogs.dir folder is currently not writeable. Upload of new images and attachments in child blogs will fail.
it_it: La cartella wp-content/blogs.dir al momento non è scrivibile. Non sarà possibile caricare nuove immagini ed allegati nei blog del network.

source: Define the permission set that you want to use on files and folders:
it_it: Definisci i permessi che vuoi imporre a file e cartelle:

source: Folder / file
it_it: Cartella / file

source: User
it_it: Utente

source: Group
it_it: Gruppo

source: All
it_it: Tutti

source: Folder, writeable
it_it: Cartella, scrivibile

source: Suggested: %d %d %d
it_it: Suggerito: %d %d %d

source: Folder, protected
it_it: Cartella, protetta

source: File, writeable
it_it: File, scrivibile

source: File, protected
it_it: File, protetto

source: Update settings
it_it: Salva impostazioni

source: Protect folders and files from unhautorized changes managing filesystem permissions.
it_it: Proteggi file e cartelle da modifiche non autorizzate mediante la gestione dei permessi a filesystem.
